
Karachi#sh ip nat translations 
Karachi#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Karachi(config)#acc
Karachi(config)#access-list ?
  <1-99>     IP standard access list
  <100-199>  IP extended access list
Karachi(config)#access-list 1 ?
  deny    Specify packets to reject
  permit  Specify packets to forward
  remark  Access list entry comment
Karachi(config)#access-list 1 permit 10.0.0.0 ?
  A.B.C.D  Wildcard bits
  <cr>
Karachi(config)#access-list 1 permit 10.0.0.0 0.255.255.255
Karachi(config)#ip nat pool ccna 122.1.1.1 122.1.1.4 ?
  netmask  Specify the network mask
Karachi(config)#ip nat pool ccna 122.1.1.1 122.1.1.4 ne
Karachi(config)#ip nat pool ccna 122.1.1.1 122.1.1.4 netmask ?
  A.B.C.D  Network mask
Karachi(config)#ip nat pool ccna 122.1.1.1 122.1.1.4 netmask 255.255.255.0
Karachi(config)#ip nat inside source list 1 pool ccna
Karachi(config)#int fa0/0
Karachi(config-if)#ip nat inside
Karachi(config-if)#exit
Karachi(config)#int se0/3/0
Karachi(config-if)#ipnat ou
Karachi(config-if)#ipnat ou
Karachi(config-if)#ip nat out
Karachi(config-if)#ip nat outside 
Karachi#sh ip nat translations 
Pro  Inside global     Inside local       Outside local      Outside global
icmp 122.1.1.1:1       10.0.0.2:1         204.0.0.30:1       204.0.0.30:1
icmp 122.1.1.2:1       10.0.0.3:1         204.0.0.30:1       204.0.0.30:1
icmp 122.1.1.3:2       10.0.0.4:2         204.0.0.30:2       204.0.0.30:2
icmp 122.1.1.4:1       10.0.0.5:1         204.0.0.30:1       204.0.0.30:1
--> 4 out 0f 6 are connected with internet, other two are not.
